{
  "pageName": "home",
  "sections": [
    {
      "title": "hero",
      "content": {
        "headings": ["Hi, my name is", "Alexander Hom"],
        "subHeadings": ["I am a software engineer from", "San Francisco"],
        "text": [],
        "images": [
          {
            "name": "DeveloperSetup.svg",
            "altText": "Desk with chair and computer monitor"
          }
        ],
        "icons": [],
        "buttons": [],
        "listContent": []
      }
    },
    {
      "title": "overview",
      "content": {
        "heading": "A quick overview",
        "subHeadings": [
          "4+ years of professional software engineering",
          "Experience across the full tech stack",
          "Successful and timely delivery of projects",
          "Learning throughout my journey"
        ],
        "text": [
          "I have experience developing large enterprise APIs for two of the largest companies in the world",
          "I am skilled in developing modern, scalable applications using JavaScript, Java, Python, SQL, MongoDB, and Google Cloud",
          "Through collaboration and leadership, I've contributed to the successful delivering of projects of various scales",
          "I am always learning and applying the latest technologies, from trending AI topics to ways of improving developer experience"
        ],
        "images": [],
        "icons": ["Terminal", "Braces", "Trophy", "JournalCode"],
        "buttons": [],
        "listContent": []
      }
    },
    {
      "title": "reflection",
      "content": {
        "heading": "A tale of two passions: art and technology",
        "subHeadings": [],
        "text": [
          "Growing up, two of my interests were art and technology. I enjoyed creating objects with Lego, folding origami, and designing architectural structures. At the same time, I was fascinated with the inner workings of websites and was very enthusiastic about developing my own.",
          "Today, as a software engineer, I get to combine my two passions as part of the software development process — putting on my artist cap when designing user interfaces and applying my interest in technology while programming applications using the latest technologies."
        ],
        "images": [
          {
            "name": "CodeEditorAndWebsite.svg",
            "altText": "Code editor and website"
          }
        ],
        "icons": [],
        "buttons": [],
        "listContent": []
      }
    },
    {
      "title": "experience",
      "content": {
        "heading": "Full stack development expertise",
        "subHeadings": [
          "Building modern and responsive user interfaces",
          "Designing and developing robust and scalable backend APIs",
          "Deploying to the cloud with the latest technologies"
        ],
        "text": [
          "Proficient in designing responsive web applications with Figma and developing them with modern JavaScript using React and its ecosystem of tools and packages, like Redux",
          "Experienced in developing large-scale microservices using various backend frameworks and technologies, like Spring Boot and Flask, and testing APIs using frameworks, such as JUnit and Karate",
          "Knowledgable in developing and deploying applications using Google Cloud Platform and cloud-native technologies, such as Kubernetes"
        ],
        "images": [
          {
            "name": "Website.svg",
            "altText": "Website"
          },
          {
            "name": "Server.svg",
            "altText": "Server"
          },
          {
            "name": "Cloud.svg",
            "altText": "Cloud"
          }
        ],
        "icons": [],
        "buttons": [],
        "listContent": []
      }
    }
  ]
}
